message = """
📌Контрольная работа #1

Вы очень ждете информацию о КР-1. Вот она:
- КР-1 будет проходить на этой неделе со среды (6 ноября) по субботу (9 ноября)
- каждый день КР будет открываться в промежутке с 18:00 до 21:00
- КР проводится на GeoLin'е

Порядок действий:
1. Выбираете день, в который вам было бы удобно писать контрольную работу.
2. Проверяете свой доступ в GeoLin. При наличии проблем обращаться в соответствующий канал (см. пост выше).
3. Запускаете работу и выполняете ее в течение 90 минут. Обратите внимание, что если вы начали работу (например) в 20:00, то доступ к работе закроется все равно в 21:00!
4. Сразу после завершения КР необходимо отправить результаты и решения заданий вашему преподавателю практики (узнавайте у них, какие каналы коммуникации для них удобны).

Демо-вариант будет загружен в силлабус до 19:00.
"""

example_task = {"name":"Коллок Мат.Ан. 1122","date":{"dayM":14,"mon":11,"time":[960,1050]},"times":1,"tags":{"WHERE":"LOMO","LABOR":"LESSON","IMPORTANT":"YES"}}
# name - имя задачи
# date - список возможного времени
# - - dayW - день недели
# - - dayM - день месяца
# - - mon  - месяц
# - - time - cписок из времени начала и времени конца - в минутах
# times - кол-во раз, которое можно выполнить задачу, 0 означает бесконечность (т.е. регулярная задача)
# tags  - cписок тегов, вид "ГРУППА ТЕГОВ": "ЗНАЧЕНИЕ ТЭГА"

from transformers import AutoModelForCausalLM, AutoTokenizer
import torch

# Загрузка модели и токенизатора
model_name = "EleutherAI/gpt-neo-1.3B"
model = AutoModelForCausalLM.from_pretrained(model_name)
tokenizer = AutoTokenizer.from_pretrained(model_name)
